[M_Orchid_PlotMission07 MissionDefinition]
MissionDescription="In attempting to remove the final piece of Captain Blade's compass from a chest, you inadvertently blasted said compass piece to bits. Herbert, feeling mildly upset about the whole situation, has offered to help you. If you can find a few samples of poly-kryten from the [place]Washburne Refinery[-place], Herbert will be able to replace the compass part you kind-of-sort-of destroyed."
TurnInDescription="Finally! With the last piece repaired and functional, you should be able to reassemble Captain Blade's compass and uncover the location of the Treasure of the Sands."
MissionSummary="Repair the final piece of Captain Blade's compass."

[M_Orchid_PlotMission07:CollectItems MissionObjectiveDefinition]
ProgressMessage="Collect poly-kryten"

[M_Orchid_PlotMission07:GivePackageSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="In attempting to remove the final piece of Captain Blade's compass from a chest, you inadvertently blasted said compass piece to bits. Luckily, Herbert was able to repair it for you. Now all that is left to do is return to Captain Scarlett with the compass piece. Oh... and there's also that little matter of Herbert's gift."

[M_Orchid_PlotMission07:GivePolykryten MissionObjectiveDefinition]
ProgressMessage="Give Herbert poly-kryten"

[M_Orchid_PlotMission07:ReturnFinalSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="In attempting to remove the final piece of Captain Blade's compass from a chest, you inadvertently blasted said compass piece to bits. Luckily, Herbert was able to repair it for you. Now all that is left to do is return to Captain Scarlett with the compass piece. You may also want to take a shower."

[M_Orchid_PlotMission07:TakeCompass MissionObjectiveDefinition]
ProgressMessage="Pick up Herbert's compass piece"

[M_Orchid_PlotMission07:TakeCompassSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="In attempting to remove the final piece of Captain Blade's compass from a chest, you inadvertently blasted said compass piece to bits. Herbert, feeling mildly upset about the whole situation, offered his help and was able to patch it together for you."
